<?php

return [
    "common" => [
        "submit-btn" => "حفظ"
    ],
    "user" => [
        'email' => "البريد الإلكتروني",
        "l-name" => "الاسم الأخير",
        "f-name" => "الاسم الأول",
        "profile-img" => "صورة الملف الشخصي",
        "card-number" => "رقم البطاقة الوطنية",
        "b-date" => "تاريخ الميلاد",
        'b-place' => "مكان الميلاد",
        "address" => "العنوان",
        'tel' => "رقم الهاتف",
        "work-title" => "اللقب الوظيفي",
        "field" => "مجال العمل",
        "specialty" => "التخصص",
        "experience" => "الخبرة",
        "grade" => "الدرجة",
        "h3" => "يجب أن يكون البريد الإلكتروني صالحًا، سيتم إرسال رمز التحقق إليه",
        "for" => [
            "add-employee" => "إضافة موظف",
            "update-employee"=>"تحديث الموظف"
        ],
        "profile-pic-type-err"=>"يجب أن تكون الصورة الشخصية صورة"
    ],
    "role" => [
        "for" => [
            "manage" => "إدارة الأدوار"
        ]
        ],

        "patient" => [
            "code" => "رمز المريض",
            "fNameFr" => "الاسم الأول بالفرنسية",
            "fNameAr" => "الاسم الأول بالعربية",
            "lNameAr" => "اللقب بالعربية",
            "lNameFr" => "اللقب بالفرنسية",
            "FPhone" => "الهاتف الأول",
            "SPhone" => "الهاتف الثاني",
            "email" => "البريد الإلكتروني",
            "address" => "العنوان",
            "bDate" => "تاريخ الميلاد",
            "bPlace" => "مكان الميلاد",
            "cardNumber" => "رقم البطاقة الوطنية",
            "mState" => "الحالة الزوجية",
            "gender" => "الجنس",
            "doctorId" => "الطبيب",
            "doctrName","اسم الطبيب",
            "for" => [
                "add" => "إضافة مريض",
                "update" => "تحديث بيانات المريض"
            ],
            "patient-pic-type-err" => "يجب أن تكون صورة المريض بصيغة صورة"
        ],
        'medical-stay' => [
            "active-stay-err" => "لا يمكنك إضافة إقامة طبية أخرى لهذا المريض لأن لديه إقامة نشطة بدون تاريخ إطلاق",
            'entryDate' => 'تاريخ الدخول',
            'room' => 'الغرفة',
            'bed' => 'السرير',
            'entryMode' => 'طريقة الدخول',
            'diagnostic' => 'التشخيص',
            'releaseDate' => 'تاريخ الخروج',
            'releaseMode' => 'طريقة الخروج',
            'releaseState' => 'حالة الخروج',
            'indicationGiven' => 'تم تقديم التوجيه',
            'patientId' => 'المريض',
            'for' => [
                'add' => 'إضافة إقامة طبية',
                'update' => 'تحديث الإقامة الطبية',
            ]
            ],
            'examen-radio' => [
                'type' => 'نوع الفحص',
                'report' => 'تقرير الفحص',
                'images' => 'صور الفحص',
                'for' => [
                    'add' => 'إضافة فحص إشعاعي',
                    'update' => 'تحديث الفحص الإشعاعي',
                ],
                'img-type-err' => 'واحد على الأقل من صور الفحص ليس بتنسيق صورة صالح.',
            ],
];
